provinces = ['강원', '경기', '경기고양', '경기광명', '경기김포', '경기부천', '경기안산', '경기안양', 
            '경기인천', '경남', '경북', '광주', '대구', '대구서', '대전', '서울', '서울강남', '서울강서', 
            '서울관악', '서울구로', '서울금천', '서울동대문', '서울동작', '서울서대문', 
            '서울서초', '서울양천', '영경기', '영서울', 
            '영인천', '인천', '인천계양', '인천남동', '인천미주홀', '인천미추홀', '인천부평', '인천서', '인천연수', 
            '인천중', '전남', '전북', '충남', '충북']


chars = ["皖", "沪", "津", "渝", "冀", "晋", "蒙", "辽", "吉", "黑",
         "苏", "浙", "京", "闽", "赣", "鲁", "豫", "鄂", "湘", "粤", 
         "桂", "琼", "川", "贵", "云", "藏", "陕", "甘", "青", "宁",
         "新", "警", "学", 'A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'J', 
         'K', 'L', 'M', 'N', 'P', 'Q', 'R', 'S', 'T', 'U', 'V', 'W', 'X',
       'Y', 'Z', '0', '1', '2', '3', '4', '5', '6', '7', '8', '9', 'O']            





# Korean Default
provinces = ['강원', '경기', '경기고양나', '경기고양다', '경기고양사', '경기고양타', '경기광명파', 
'경기김포자', '경기부천다', '경기부천바', '경기부천사', '경기부천아', '경기부천자', '경기부천차', 
'경기부천카', '경기부천타', '경기부천파', '경기부천하', '경기안산라', '경기안양바', '경기인천아', 
'경남', '경북', '광주', '대구', '대구서하', '대전', '서울', '서울강남타', '서울강남파', '서울강남하',
'서울강서자', '서울강서차', '서울관악카', '서울관악파', '서울구로가', '서울구로자', '서울구로카', 
'서울금천자', '서울동대문파', '서울동작자', '서울서대문다', '서울서대문마', '서울서대문바', '서울서초마', 
'서울양천마', '서울양천자', '서울양천차', '서울영등포아', '서울용산자', '영경기', '영서울', '영인천', '인천', 
'인천계양사', '인천남동파', '인천미주홀파', '인천미추홀파', '인천부평사', '인천부평아', '인천서타', '인천연수나', '인천연수다', 
'인천중마', '전남', '전북', '충남', '충북']

chars = ['0', '1', '2', '3', '4', '5', '6', '7', '8', '9', '가', '거', '고', '구', '나', '너', '노', '누', '다', 
         '더', '도', '두', '라', '러', '로', '루', '마', '머', '모', '무', '바', '버', '보', '부', '사', '서', '소', 
         '수', '시', '아', '어', '오', '우', '육', '자', '저', '조', '주', '하', '허', '호', '히']

# 미주홀은 미추홀 오타
province_redundant = ['강원', '경기', '경기고양', '경기광명', '경기김포', '경기부천', '경기안산', '경기안양', '경기인천', 
                    '경남', '경북', '광주', '대구', '대구서', '대전', '서울', '서울강남',
                     '서울강서', '서울관악', '서울구로', '서울금천', 
                    '서울동대문', '서울동작', '서울서대문', '서울서초', '서울양천', 
                   '서울영등포', '서울용산', '영경기', '영서울', '영인천', '인천', '인천계양', 
                   '인천남동', '인천미주홀', '인천미추홀', '인천부평', '인천서', '인천연수'
                  '인천중', '전남', '전북', '충남', '충북']

province_process = ['강원', '경기', '고양', '광명', '김포', '부천', '안산', '안양', '인천', '경남', '경북', '광주', '대구', '대구서', '대전', '서울', '강남',
                    '강서', '관악', '구로', '금천', '동대문', '동작', '서대문', '서초', '양천', '영등포', '용산', '영', '인천', '계양', '남동', '미추홀', '부평',
                    '인천서', '연수', '인천중', '전남', '전북', '충남', '충북']

province_final = ['강남', '강서', '강원', '경기', '경남', '경북', '계양', '고양', '관악', '광명', '광주', '구로', 
                '금천', '김포', '남동', '대구', '대구서', '대전', '동대문', '동작', '미추홀', '부천', '부평', '서대문', 
                '서울', '서초', '안산', '안양', '양천', '연수', '영', '영등포', '용산', '인천', '인천서', '인천중', '전남', '전북', '충남', '충북']

province_bylength = ['대구서', '동대문', '미추홀', '서대문', '영등포', '인천서', '인천중',
                    '강남', '강서', '강원', '경기', '경남', '경북', '계양', '고양', '관악', '광명', '광주', '구로', '금천', '김포', '남동', 
                    '대구', '대전', '동작', '부천', '부평', '서울', '서초', '안산', '안양', '양천', '연수', '용산', '인천', '전남', '전북', 
                    '충남', '충북', '영']

province_replace = ['괅', '놝', '돩', '랅', '맑', '밝', '삵', '앍', '잙', '찱',
                    '괉', '놡', '돭', '랉', '맕', '밡', '삹', '앑', '잝', '찵',
                    '괋', '놣', '돯', '뢇', '맗', '밣', '삻', '앓', '잟', '찷',
                    '괇', '놟', '돫', '뢃', '맓', '밟', '삷', '앏', '잛', '찳']